<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_05.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Membalik urutan baris dan kolom pada Data Frame**

---

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5

cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)), columns=cols)

df

   A  B  C  D  E
0  7  2  2  1  4
1  3  6  6  2  8
2  8  5  3  7  7
3  4  7  4  7  6
4  2  9  9  1  9

Membalik Urutan Kolom

In [5]:
df.loc[:, ::-1]

#Bagian kiri bertugas untuk mengatur baris
#Bagian kanan bertugas untuk mengatur kolom
# -1 berfungsi untuk reverse

   E  D  C  B  A
0  4  1  2  2  7
1  8  2  6  6  3
2  7  7  3  5  8
3  6  7  4  7  4
4  9  1  9  9  2

Membalik Urutan Baris

In [7]:
df.loc[::-1]
#Karena pengaturan baris berada pada sisi kiri, sisi kanan tidak perlu dibuat jika tidak ingin diubah

   A  B  C  D  E
4  2  9  9  1  9
3  4  7  4  7  6
2  8  5  3  7  7
1  3  6  6  2  8
0  7  2  2  1  4

Membalik Urutan Baris dan Melakukan Penyesuaian Ulang Index

In [9]:
df.loc[::-1].reset_index(drop=True)

#drop=True berfungsi untuk menghapus index yang lama

   A  B  C  D  E
0  2  9  9  1  9
1  4  7  4  7  6
2  8  5  3  7  7
3  3  6  6  2  8
4  7  2  2  1  4